УТ.ФБ_КоннекторШины/src/ExchangePlans/ш_ОбменДаннымиПоПравиламКД3/ш_ОбменДаннымиПоПравиламКД3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="368459dc-7c9c-415f-a75a-1a4c3c27842c">
  <name>ш_ОбменДаннымиПоПравиламКД3</name>
  <attributes>
    <name>ТипСообщенияОбмена</name>
    <type>
      <types>CatalogRef.ш_ТипыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Система</name>
    <type>
      <types>CatalogRef.ш_Системы</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выгрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьСообщенияБезДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

УТ.ФБ_КоннекторШины/src/ExchangePlans/ш_ОбменДаннымиПоПравиламКД3/Forms/ФормаУзла/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Ссылка.Пустая() Тогда
		СсылкаНаОбъект = ПланыОбмена.ш_ОбменДаннымиПоПравиламКД3.ПолучитьСсылку(Новый УникальныйИдентификатор);
		ТекущийОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);
	Иначе
		СсылкаНаОбъект = ТекущийОбъект.Ссылка;
	КонецЕсли;
	
	Попытка
		
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ТекущийОбъект.ИДРегламентногоЗадания));
		
		Если Задание = Неопределено И ТекущийОбъект.Использование И ТекущийОбъект.Выгрузка Тогда
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ш_ВыполнениеОбменаПоПравиламКД2);
		ИначеЕсли НЕ Задание = Неопределено И ( НЕ ТекущийОбъект.Использование ИЛИ НЕ ТекущийОбъект.Выгрузка ) Тогда
			Задание.Удалить();
		КонецЕсли;
		
	Исключение
		
		Если ТекущийОбъект.Использование И ТекущийОбъект.Выгрузка Тогда
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ш_ВыполнениеОбменаПоПравиламКД2);
		КонецЕсли;
		
	КонецПопытки;
	
	Если ТекущийОбъект.Использование И ТекущийОбъект.Выгрузка Тогда
		
		Задание.Использование = ТекущийОбъект.Использование;
		Задание.Ключ = Новый УникальныйИдентификатор;
		Задание.Наименование = СтрШаблон("%1 (%2(%3))", Метаданные.РегламентныеЗадания.ш_ВыполнениеОбменаПоПравиламКД2.Синоним, ТекущийОбъект.Наименование, ТекущийОбъект.Код);
		Задание.Расписание = СтрокаВРасписание(ТекущееРасписание);
		Задание.Параметры.Очистить();
		Задание.Параметры.Добавить(СсылкаНаОбъект);
		Задание.Записать();
		
		ТекущийОбъект.ИДРегламентногоЗадания = Задание.УникальныйИдентификатор;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ИспользованиеПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРасписанияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РедактированиеРасписания = Новый ДиалогРасписанияРегламентногоЗадания(СтрокаВРасписание(ТекущееРасписание));
	РедактированиеРасписания.Показать(Новый ОписаниеОповещения("ПослеОкончанияРедактированияРасписания", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияРедактированияРасписания(Расписание, Контекст) Экспорт
	
	Если Расписание = Неопределено Тогда
		
	Иначе
		ПредставлениеРасписания = Строка(Расписание);
		ТекущееРасписание = РасписаниеВСтроку(Расписание);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура НастроитьВидимостьДоступность()
	
	Попытка
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Объект.ИДРегламентногоЗадания));
		ПредставлениеРасписания = Строка(Задание.Расписание);
		ТекущееРасписание = РасписаниеВСтроку(Задание.Расписание);
	Исключение
		ПредставлениеРасписания = "<установить расписание>";
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция РасписаниеВСтроку(Расписание) Экспорт
	
	Если Строка(Расписание) = "один день; один раз в день" Тогда
		Возврат "";
	Иначе
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML,Расписание);
		
		Возврат ЗаписьXML.Закрыть();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СтрокаВРасписание(СтрокаРасписания) Экспорт
	
	Если СтрокаРасписания = "" Тогда 
		Возврат Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(СтрокаРасписания);
		Расписание = СериализаторXDTO.ПрочитатьXML(ЧтениеXML,Тип("РасписаниеРегламентногоЗадания"));
	Исключение
		Расписание = Новый РасписаниеРегламентногоЗадания;
	КонецПопытки;

	Возврат Расписание;
	
КонецФункции

#КонецОбласти
